cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'coreutils'
brew 'cmake'
brew 'openssl'
brew 'node'
brew 'postgresql'
brew 'rbenv'
brew 'ruby-build'
brew 'rbenv-default-gems'
brew 'rbenv-gemset'
brew 'heroku-toolbelt'
brew 'wget'
brew 'yarn'
brew 'redis'
brew 'mongodb'
brew 'zsh'
brew 'zsh-completions'
brew 'tree'
brew 'vim'
brew 'python'
brew 'pyenv'
brew 'gcc'
brew 'mysql'
brew 'git-extras'
brew 'fortune'
brew 'cowsay'

cask 'iterm2'
cask 'firefox'
cask 'google-chrome'
cask 'opera'
cask 'spectacle'
cask 'android-studio'
cask 'visual-studio-code'
cask 'sourcetree'
cask 'xquartz'
cask 'pgadmin4'
cask 'spotify'
cask 'slack'
cask 'vlc'
cask 'sequel-pro'
cask 'docker'
cask 'caffeine'
cask 'google-backup-and-sync'
cask 'tomighty'
